Revit 2027 API
Application.NewFamilyInstanceCreationData(XYZ, FamilySymbol, Level, StructuralType) Method
Creates an object which wraps the arguments of NewFamilyInstance() for batch creation.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FamilyInstanceCreationData NewFamilyInstanceCreationData(
	XYZ location,
	FamilySymbol symbol,
	Level level,
	StructuralType structuralType
)
Public Function NewFamilyInstanceCreationData (
	location As XYZ,
	symbol As FamilySymbol,
	level As Level,
	structuralType As StructuralType
) As FamilyInstanceCreationData
public:
FamilyInstanceCreationData^ NewFamilyInstanceCreationData(
	XYZ^ location,
	FamilySymbol^ symbol,
	Level^ level,
	StructuralType structuralType
)
member NewFamilyInstanceCreationData :
        location : XYZ *
        symbol : FamilySymbol *
        level : Level *
        structuralType : StructuralType -> FamilyInstanceCreationData
Parameters
location XYZ
 The physical location where the instance is to be placed.
symbol FamilySymbol
 A FamilySymbol object that represents the type of the instance that is to be inserted.
level Level
 A Level object that is used as the base level for the object.
structuralType StructuralType
 If structural then specify the type of the component.
Return Value
FamilyInstanceCreationData
See Also
Reference
Application Class
NewFamilyInstanceCreationData Overload
Autodesk.Revit.Creation Namespace